InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДополнительныеСведения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/B2B_СоответствиеСкладВидНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>B2B_СоответствиеСкладВидНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/B2B_СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>B2B_СтатусыЗаказов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_В2ВСтатусЗаказаКлиента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ЗаказКлиента</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/B2B_СЭ_ТипНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>B2B_СЭ_ТипНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СЭ_ГруппаБитрикса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.B2B_Б_ПользовательскиеГруппыТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/B2B_СправочникНоменклатураУПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>B2B_СправочникНоменклатураУПП</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/B2B_ОбщиеПроцедурыИФункции/Ext/Module.bsl
#Область JSON

// Получить из текста JSON структуру.
// 
// Параметры:
// 	ТекстJSON                    - Строка - Текст JSON.
// 	ПреобразовыватьВСоответствие - Булево - Признак преобразования в соответствие.
// Возвращаемое значение:
// 	Структура, Неопределено - Результат преобразования JSON.
Функция ТекстJSONВОбъект(ТекстJSON, ПреобразовыватьВСоответствие = Ложь) Экспорт
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	
	Попытка
		РезультатРазбора = ПрочитатьJSON(Чтение, ПреобразовыватьВСоответствие);
	Исключение
		РезультатРазбора = Неопределено;
	КонецПопытки;
	
	Возврат РезультатРазбора
	
КонецФункции

// Формирует из структуры текст JSON
// 
// Параметры:
// 	Структура - Структура - Произвольная структура данных
// Возвращаемое значение:
// 	Строка - Текст JSON
Функция ОбъектВТекстJSON(Структура) Экспорт
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, "  ");
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписатьJSON(ЗаписьJSON, Структура);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

#КонецОбласти

#Область HTTPЗапросы

// Структура результата HTTP запроса
// 
// Параметры:
// Возвращаемое значение:
// 	Структура - Результат HTTP-запроса:
// * КодСостояния - Число        - Код состояния HTTP
// * Заголовки    - Соответствие - Заголовки HTTP ответа
// * ТекстОтвета  - Строка       - Текст ответа
// * ТекстОшибки  - Строка       - Текст ошибки
Функция РезультатHTTPЗапроса() Экспорт
	
	РезультатHTTPЗапроса = Новый Структура;
	РезультатHTTPЗапроса.Вставить("КодСостояния");
	РезультатHTTPЗапроса.Вставить("Заголовки");
	РезультатHTTPЗапроса.Вставить("ТекстОтвета");
	РезультатHTTPЗапроса.Вставить("ТекстОшибки");	
	
	Возврат РезультатHTTPЗапроса;
	
КонецФункции

// Инициализирует структуру результата обработки HTTP-запроса после получения ответа.
// 
// Параметры:
// 	ТекстВходящегоСообщенияJSON - Строка - Текст входящего сообщения.
// 	КодСостояния                - Число  - Код состояния.
// 
// Возвращаемое значение:
// Структура - Структура со свойствами:
//   ЗапросОтправлен             - Булево - признак того, что сообщеие отправлено.
//   ОтветПолучен                - Булево - признак того, что сообщение обработано сервером.
//   КодСостояния                - Число  - Код состояния HTTP-запроса.
//   ТекстОшибки                 - Строка - текст ошибки, если таковая возникла.
//   ТекстВходящегоСообщенияJSON - Строка - текст ответа, на отправленное сообщение.
//
Функция HTTPОтветПолучен(ТекстВходящегоСообщенияJSON, КодСостояния = 200, КакФайл = Ложь)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЗапросОтправлен",             Истина);
	ВозвращаемоеЗначение.Вставить("ОтветПолучен",                Истина);
	
	ВозвращаемоеЗначение.Вставить("КодСостояния",                КодСостояния);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                 "");
	
	Если КакФайл Тогда
		ВозвращаемоеЗначение.Вставить("ИмяФайла",                    ТекстВходящегоСообщенияJSON);
	Иначе
		Объект = ТекстJSONВОбъект(ТекстВходящегоСообщенияJSON, Истина);
		Если Объект <> Неопределено Тогда
			ВозвращаемоеЗначение.Вставить("ТекстВходящегоСообщенияJSON", ОбъектВТекстJSON(Объект));
		Иначе
			ВозвращаемоеЗначение.Вставить("ТекстВходящегоСообщенияJSON", ТекстВходящегоСообщенияJSON);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Инициализирует структуру результата обработки HTTP-запроса после отправки сообщения, но до получения ответа.
// 
// Возвращаемое значение:
// Структура:
//   ЗапросОтправлен             - Булево - признак того, что сообщеие отправлено.
//   ОтветПолучен                - Булево - признак того, что сообщение получено.
//   КодСостояния                - Число  - Код состояния HTTP-запроса.
//   ТекстОшибки                 - Строка - текст ошибки, если таковая возникла.
//   ТекстВходящегоСообщенияJSON - Строка - текст ответа, на отправленное сообщение.
//
Функция HTTPОтветНеПолучен(Ошибка, ЗапросОтправлен, КодСостояния = Неопределено, КакФайл = Ложь)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЗапросОтправлен",             ЗапросОтправлен);
	ВозвращаемоеЗначение.Вставить("ОтветПолучен",                Ложь);
	
	ВозвращаемоеЗначение.Вставить("КодСостояния",                КодСостояния);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                 Строка(Ошибка));
	
	Если КакФайл Тогда
		ВозвращаемоеЗначение.Вставить("ИмяФайла", "");
	Иначе
		ВозвращаемоеЗначение.Вставить("ТекстВходящегоСообщенияJSON", "");
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Обработать результат отправки HTTP-запроса к сервису ИС МОТП.
// 
// Параметры:
// 	HTTPОтвет   - HTTPОтвет - HTTP-ответ
// 	ТекстОшибки - Строка    - Текст ошибки
// Возвращаемое значение:
// Структура - Результат отправки HTTP-запроса:
//  * ЗапросОтправлен             - Булево - признак того, что сообщеие отправлено.
//  * ОтветПолучен                - Булево - признак того, что сообщение получено.
//  * КодСостояния                - Число  - Код состояния HTTP-запроса.
//  * ТекстОшибки                 - Строка - текст ошибки, если таковая возникла.
//  * ТекстВходящегоСообщенияJSON - Строка - текст ответа, на отправленное сообщение.
Функция ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(HTTPОтвет, Знач ТекстОшибки) Экспорт
	
	ВозвращаемоеЗначение = Неопределено;
	
	РезультатОтправкиHTTPЗапроса = РезультатHTTPЗапроса();
	РезультатОтправкиHTTPЗапроса.ТекстОшибки = ТекстОшибки;
	Если HTTPОтвет <> Неопределено Тогда
		РезультатОтправкиHTTPЗапроса.КодСостояния = HTTPОтвет.КодСостояния;
		РезультатОтправкиHTTPЗапроса.Заголовки    = HTTPОтвет.Заголовки;
		РезультатОтправкиHTTPЗапроса.ТекстОтвета  = HTTPОтвет.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	КодСостояния = РезультатОтправкиHTTPЗапроса.КодСостояния;
	ТекстОтвета  = РезультатОтправкиHTTPЗапроса.ТекстОтвета;
	
	Если ЗначениеЗаполнено(ТекстОтвета) Тогда
		
		ВозвращаемоеЗначение = HTTPОтветПолучен(ТекстОтвета, КодСостояния);
		
	Иначе
		
		Если Не ЗначениеЗаполнено(КодСостояния) Тогда
			ТекстСообщенияXMLОтправлен = Ложь;
			ЗаголовокОшибки = НСтр("ru = 'HTTP-запрос не отправлен.'");
		Иначе
			ТекстСообщенияXMLОтправлен = Истина;
			ЗаголовокОшибки = СтрШаблон(НСтр("ru = 'Код состояния HTTP: %1.'"), КодСостояния);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатОтправкиHTTPЗапроса.ТекстОшибки) Тогда
			ТекстОшибки = ЗаголовокОшибки + Символы.ПС + РезультатОтправкиHTTPЗапроса.ТекстОшибки;
		Иначе
			ТекстОшибки = ЗаголовокОшибки;
		КонецЕсли;
		
		ВозвращаемоеЗначение = HTTPОтветНеПолучен(
			ТекстОшибки,
			ТекстСообщенияXMLОтправлен,
			КодСостояния);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

Функция ЗаписатьЗначениеСвойства(Объект,СтруктураСвойства) Экспорт    
    НаборЗаписейЗначенияСвойств = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
    Если ЗначениеЗаполнено(СтруктураСвойства.Значение) Тогда
        Запись = НаборЗаписейЗначенияСвойств.Добавить();
        Запись.Объект   = Объект.Ссылка;
        Свойство=СтруктураСвойства.Свойство;
        Запись.Свойство = Свойство.Ссылка;
        Запись.Значение = СтруктураСвойства.Значение;
    КонецЕсли;
    
    НаборЗаписейЗначенияСвойств.Отбор.Объект.Установить(Объект.Ссылка);
    НаборЗаписейЗначенияСвойств.Отбор.Свойство.Установить(Свойство); //.Ссылка
    Попытка
        НаборЗаписейЗначенияСвойств.Записать();
    Исключение
        Возврат Ложь;
    КонецПопытки;
    Возврат Истина;    
КонецФункции

Функция ПолучитьЗначениеСвойства(Объект, Свойство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &Свойство
	|	И ЗначенияСвойствОбъектов.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Свойство", Свойство);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Значение;
	
КонецФункции

Функция НайтиОбъект(Свойство, Значение) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1 Объект ИЗ РегистрСведений.ДополнительныеСведения ГДЕ Свойство = &Свойство И Значение = &Значение");
		
	Запрос.УстановитьПараметр("Свойство", Свойство);
	Запрос.УстановитьПараметр("Значение", Значение);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат = Выборка.Объект;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьВременныеТаблицыПоЗаказам(МассивДанных) Экспорт
	
	ОбщийЗапрос = Новый Запрос;
	
	ОбщийЗапрос.УстановитьПараметр("МассивДанных", МассивДанных);
	
	МенеджерВременныхТаблицДокументов 	= Новый МенеджерВременныхТаблиц;
	ОбщийЗапрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблицДокументов;
	
	ОбщийЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	|	ЗаказПокупателя.Контрагент КАК Контрагент,
	|	ЗаказПокупателя.Номер КАК Номер,
	|	ЗаказПокупателя.Дата КАК Дата,
	//|	ЗаказПокупателя.ДатаОплаты КАК ДатаОплаты,
	|	ЗаказПокупателя.Дата КАК ДатаОплаты,
	|	ЗаказПокупателя.ДатаОтгрузки КАК ДатаОтгрузки, 
	|	ЗаказПокупателя.RC_ИмяЗаказа КАК RC_ИмяЗаказа,
	|	ЗаказПокупателя.КонтактноеЛицо КАК КонтактноеЛицоКонтрагента,
	|	ЗаказПокупателя.АдресДоставки КАК АдресДоставкиНовый
	|ПОМЕСТИТЬ Заказы
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка КАК Документ,
	|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура, 
	|	ЗаказПокупателяТовары.Характеристика КАК Характеристика,
	|	ЗаказПокупателяТовары.Количество КАК Количество,
	|	ЗаказПокупателяТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказПокупателяТовары.СуммаНДС КАК СуммаНДС,
	|	ЗаказПокупателяТовары.Сумма КАК Сумма,
	|	ЗаказПокупателяТовары.Цена КАК Цена
	//1БЦ++ 31929
	|	,ЗаказПокупателяТовары.Склад КАК Размещение
	//1БЦ-- 31929
	|ПОМЕСТИТЬ ТабТовары
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				Заказы.Ссылка КАК Ссылка
	|			ИЗ
	|				Заказы КАК Заказы)";
	
	ОбщийЗапрос.Выполнить();	
	
	Возврат МенеджерВременныхТаблицДокументов;
	
КонецФункции

Процедура ВыгрузитьДокументы(НастройкиПодключения, МассивДокументов) Экспорт
	
	АдресСервера    = НастройкиПодключения.Получить("АдресСервера");
	Логин 			= НастройкиПодключения.Получить("Логин");
	Пароль       	= НастройкиПодключения.Получить("Пароль");
	
	лМенеджерВременныхТаблиц 	= СформироватьВременныеТаблицыПоЗаказам(МассивДокументов);

	МассивВыгруженных = Новый Массив();
	Для каждого ТекДокумент из МассивДокументов Цикл
				
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Заказ", ТекДокумент);
		Запрос.Текст = "ВЫБРАТЬ *
		|ИЗ
		|	Заказы КАК Заказы
		|ГДЕ
		|Заказы.Ссылка = &Заказ";
		МассивЗаказов = Запрос.Выполнить().Выгрузить();
		
		Для каждого ТекЗаказ из МассивЗаказов Цикл 
			
			СтруктураДокумента = ВыгрузитьЗаказ(лМенеджерВременныхТаблиц, ТекЗаказ.Ссылка);
			МассивВыгруженных.Добавить(СтруктураДокумента);
						
		КонецЦикла;
		
	КонецЦикла;
	
	ТелоЗапросаJSON = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(МассивВыгруженных);
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");

	HTTPЗапрос  = Новый HTTPЗапрос("local/service/UpdateOrderInfo/", ЗаголовокHTTP);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	HTTPОтвет   = Неопределено;
	ТекстОшибки = "";
	
	ЗащищенноеСоединение = ИнтеграцияИСПовтИсп.ЗащищенноеСоединение();
	
	Попытка
		
		Соединение = Новый HTTPСоединение(
			АдресСервера,
			,
			Логин,
			Пароль,
			,
			60, ЗащищенноеСоединение);
		
		HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Сообщить(НСтр("ru='Ошибка отправки информации по заказу'") + Символы.ПС +
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		Возврат;
		
	КонецПопытки;
	
	РезультатОтправкиЗапроса = B2B_ОбщиеПроцедурыИФункции.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(
		HTTPОтвет, ТекстОшибки);
		
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
						
			Сообщить("Документы успешно обновлены!");
			
		Иначе
			
			Сообщить(ИнтерфейсМОТПСлужебный.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				НСтр("ru='Отправка данных о заказе'"),
				РезультатОтправкиЗапроса));
				
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		Сообщить(СтрШаблон(
			НСтр("ru='Данные о заказе не отправлены.
				     |Текст ошибки: %1'"),
			РезультатОтправкиЗапроса.ТекстОшибки));
			
		Возврат;
		
	КонецЕсли;

	
КонецПроцедуры

Процедура ВыгрузитьДокументы1(НастройкиПодключения, МассивДокументов) Экспорт
	
	АдресСервера    = НастройкиПодключения.Получить("АдресСервера");
	Логин 			= НастройкиПодключения.Получить("Логин");
	Пароль       	= НастройкиПодключения.Получить("Пароль");
	
	лМенеджерВременныхТаблиц 	= СформироватьВременныеТаблицыПоЗаказам(МассивДокументов);

	МассивВыгруженных = Новый Массив();
	Для каждого ТекДокумент из МассивДокументов Цикл
				
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = лМенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Заказ", ТекДокумент);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ *
		|ИЗ
		|	Заказы КАК Заказы
		|ГДЕ
		|Заказы.Ссылка = &Заказ";
		МассивЗаказов = Запрос.Выполнить().Выгрузить();
		
		Для каждого ТекЗаказ из МассивЗаказов Цикл 
			
			СтруктураДокумента = ВыгрузитьЗаказ1(лМенеджерВременныхТаблиц, ТекЗаказ.Ссылка);
			МассивВыгруженных.Добавить(СтруктураДокумента);
						
		КонецЦикла;
		
	КонецЦикла;
	
	ТелоЗапросаJSON = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(МассивВыгруженных);
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");

	HTTPЗапрос  = Новый HTTPЗапрос("local/service/CreateOrder/", ЗаголовокHTTP);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	HTTPОтвет   = Неопределено;
	ТекстОшибки = "";
	
	ЗащищенноеСоединение = ИнтеграцияИСПовтИсп.ЗащищенноеСоединение();
	
	Попытка
		
		Соединение = Новый HTTPСоединение(
			АдресСервера,
			,
			Логин,
			Пароль,
			,
			60, ЗащищенноеСоединение);
		
		HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Сообщить(НСтр("ru='Ошибка отправки информации по заказу'") + Символы.ПС +
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		Возврат;
		
	КонецПопытки;
	
	РезультатОтправкиЗапроса = B2B_ОбщиеПроцедурыИФункции.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(
		HTTPОтвет, ТекстОшибки);
		
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			ОбъектРез = ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON, Истина);
			Если ОбъектРез.Получить("ERROR") <> Неопределено Тогда
				
			  
				
				Сообщить(СтрШаблон(
					НСтр("ru='Данные о заказе не отправлены.
						     |Текст ошибки: %1'"),
					ОбъектРез["ERROR"]["0"]));
				
			Иначе
				
				Для каждого Строка Из ОбъектРез["ORDER"] Цикл 
					
					Гуид = Строка.Значение["ORDER_XML_ID"];
					Док = Документы.ЗаказКлиента.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Гуид)));
					
					СтруктураСвойства = Новый Структура;
					СтруктураСвойства.Вставить("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("B2B_НомерЗаказа"));
					СтруктураСвойства.Вставить("Значение", Строка.Значение["ORDER_ID_IMPORT"]);
					ЗаписатьЗначениеСвойства(Док, СтруктураСвойства);
					
				КонецЦикла;
							
				Сообщить("Документы успешно созданы!!");
			КонецЕсли;
			
		Иначе
			
			Сообщить(ИнтерфейсМОТПСлужебный.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				НСтр("ru='Отправка данных о заказе'"),
				РезультатОтправкиЗапроса));
				
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		Сообщить(СтрШаблон(
			НСтр("ru='Данные о заказе не отправлены.
				     |Текст ошибки: %1'"),
			РезультатОтправкиЗапроса.ТекстОшибки));
			
		Возврат;
		
	КонецЕсли;

	
КонецПроцедуры

Функция ВыгрузитьЗаказ(МенеджерВременныхТаблиц, ТекЗаказ)
	
	Результат = Новый Структура;
	
	Результат.Вставить("ORDER_ID", СокрЛП(ТекЗаказ.Ссылка.Номер));
	Результат.Вставить("ORDER_XML_ID", СокрЛП(ТекЗаказ.Ссылка.УникальныйИдентификатор()));
	B2B_НомерЗаказа = ПолучитьЗначениеСвойства(ТекЗаказ.Ссылка, ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("B2B_НомерЗаказа"));
	Результат.Вставить("ORDER_ID_IMPORT", СокрЛП(Формат(B2B_НомерЗаказа, "ЧГ=0")));
//1БЦ++ работы по задаче 32798
//	Результат.Вставить("STATUS", СокрЛП(ПолучитьСтатусЗаказа(ТекЗаказ)));
	Статус = ПолучитьСтатусЗаказа(ТекЗаказ,Истина);
	Результат.Вставить("STATUS",СокрЛП(Статус.Статус));
	Результат.Вставить("STATUS_DATA",Статус.Дата);
//1БЦ-- работы по задаче 32798
	Результат.Вставить("PARTNER_XML_ID", СокрЛП(ТекЗаказ.Контрагент.гф_GLN_номер));
	Результат.Вставить("ADDRESS_XML_ID", СокрЛП(Формат(ТекЗаказ.гф_АдресДоставки.GLNНомер, "ЧГ=0")));
	Результат.Вставить("DOGOVOR_NUMBER", СокрЛП(ТекЗаказ.Договор.Номер));
	Результат.Вставить("DATE_DELIVERY", ТекЗаказ.ДатаОтгрузки);

	Результат.Вставить("PRODUCTS", Новый Массив());
	               
	ЗапросПоТоварам = Новый Запрос();
	ЗапросПоТоварам.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросПоТоварам.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ *
	|ИЗ
	|	ТабТовары КАК ВремТабТоваров
	|ГДЕ
	|	ВремТабТоваров.Документ = &Документ";
	ЗапросПоТоварам.УстановитьПараметр("Документ", ТекЗаказ);
	МассивТоваров = ЗапросПоТоварам.Выполнить().Выгрузить();
	
	Для каждого ТекНоменклатура из МассивТоваров Цикл
		СтруктураТЧ = Новый Структура;
		СтруктураТЧ.Вставить("CML2_ARTICLE", СокрЛП(ТекНоменклатура.Номенклатура.Артикул));
		//здесь не знаю, возможно надо к артикулу еще характеристику добавить
		
		//СтруктураТЧ.Вставить("XML_ID", XMLСтрока(ТекНоменклатура.Номенклатура.СЭ_ТипНоменклатуры) + "#" +XMLСтрока(ТекНоменклатура.Номенклатура)); 
		СтруктураТЧ.Вставить("XML_ID", ПолучитьИдТовараДляСайта(ТекНоменклатура.Номенклатура,ТекНоменклатура.Характеристика));
		
		СтруктураТЧ.Вставить("QUANTITY", СокрЛП(Формат(ТекНоменклатура.Количество, "ЧГ=0")));
				
		Всего = ?(ТекЗаказ.ЦенаВключаетНДС,ТекНоменклатура.Сумма,ТекНоменклатура.Сумма + ТекНоменклатура.СуммаНДС);
		
		PRICE = ?(ТекНоменклатура.Количество = 0,Всего,Всего/ТекНоменклатура.Количество);
		BASE_PRICE = ?(ТекЗаказ.ЦенаВключаетНДС,ТекНоменклатура.Цена ,ТекНоменклатура.Цена + ТекНоменклатура.Цена/100*ТекНоменклатура.СтавкаНДС.Ставка); 		
		DISCOUNT_PRICE = BASE_PRICE*ТекНоменклатура.Количество - Всего;
		VAT_RATE = ТекНоменклатура.СтавкаНДС.Ставка/100;
		VAT_INCLUDED  = ?(ТекЗаказ.ЦенаВключаетНДС,1,0);
		
		СтруктураТЧ.Вставить("PRICE", СокрЛП(Формат(PRICE, "ЧГ=0")));
        СтруктураТЧ.Вставить("BASE_PRICE", СокрЛП(Формат(BASE_PRICE, "ЧГ=0")));
		СтруктураТЧ.Вставить("DISCOUNT_PRICE", СокрЛП(Формат(DISCOUNT_PRICE, "ЧГ=0")));
		СтруктураТЧ.Вставить("VAT_RATE", СокрЛП(Формат(VAT_RATE, "ЧГ=0")));
		СтруктураТЧ.Вставить("VAT_INCLUDED", СокрЛП(Формат(VAT_INCLUDED, "ЧГ=0")));
		//1БЦ++ 31929
		СтруктураТЧ.Вставить("RESERV", ЗначениеЗаполнено(ТекНоменклатура.Размещение));
		//1БЦ-- 31929
		
		Результат.PRODUCTS.Добавить(СтруктураТЧ);
	КонецЦикла;
	                               
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИдТовараДляСайта(Номенклатура,Характеристика = Неопределено) Экспорт
	
	//сначала ищем в СЭ ТипНоменклатурыПоАртикулу
	Ид = Строка(Номенклатура.УникальныйИдентификатор());
	Если Характеристика <> Неопределено Тогда
		Ид = Ид + "#"+Строка(Характеристика.УникальныйИдентификатор());  
	КонецЕсли;
	
	Если Номенклатура.Артикул = "" Тогда
		Возврат Ид;
	КонецЕсли;
	
	СтарыйЭлемент = Справочники.B2B_СЭ_ТипНоменклатуры.НайтиПоРеквизиту("Артикул",Номенклатура.Артикул); 
	Если НЕ СтарыйЭлемент.Пустая() Тогда
		Ид = СтарыйЭлемент.GUID;
	Иначе
		Возврат Ид;
	КонецЕсли;
	
	//теперь ищем характеристику
	Если Характеристика <> Неопределено Тогда
		ПолныйАртикул = Номенклатура.Артикул+"/"+Характеристика.Наименование;
		СтараяХарактеристика = Справочники.B2B_СправочникНоменклатураУПП.НайтиПоРеквизиту("Артикул",ПолныйАртикул);
		Если НЕ СтараяХарактеристика.Пустая() Тогда
			Ид = Ид + "#"+СтараяХарактеристика.GUID;  
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ид;
	
КонецФункции

Функция ВыгрузитьЗаказ1(МенеджерВременныхТаблиц, ТекЗаказ)
	
	Результат = Новый Структура;
	
	Результат.Вставить("ORDER_ID", СокрЛП(ТекЗаказ.Ссылка.Номер));
	Результат.Вставить("ORDER_XML_ID", СокрЛП(ТекЗаказ.Ссылка.УникальныйИдентификатор()));
	B2B_НомерЗаказа = ПолучитьЗначениеСвойства(ТекЗаказ.Ссылка, ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("B2B_НомерЗаказа"));
	Результат.Вставить("ORDER_ID_IMPORT", СокрЛП(Формат(B2B_НомерЗаказа, "ЧГ=0")));
//1БЦ++ работы по задаче 32798
//	Результат.Вставить("STATUS", СокрЛП(ПолучитьСтатусЗаказа(ТекЗаказ)));
	Статус = ПолучитьСтатусЗаказа(ТекЗаказ,Истина);
	Результат.Вставить("STATUS",СокрЛП(Статус.Статус));
	Результат.Вставить("STATUS_DATA",Статус.Дата);
//1БЦ-- работы по задаче 32798
	Результат.Вставить("PARTNER_XML_ID", СокрЛП(ТекЗаказ.Контрагент.гф_GLN_номер));
	Результат.Вставить("ADDRESS_XML_ID", СокрЛП(Формат(ТекЗаказ.гф_АдресДоставки.GLNНомер, "ЧГ=0")));
	Результат.Вставить("DOGOVOR_NUMBER", СокрЛП(ТекЗаказ.Договор.Номер));
	Результат.Вставить("DATE_DELIVERY", ТекЗаказ.ДатаОтгрузки);
	Результат.Вставить("NAME_ORDER", ТекЗаказ.RC_ИмяЗаказа);
	
	ОсновноеКЛ = ТекЗаказ.Контрагент.B2B_ОсновноеКонтактноеЛицо;   
	Для каждого стр из ТекЗаказ.Контрагент.B2B_КонтактныеЛицаПоОрганизациям Цикл
		Если стр.Организация = ТекЗаказ.Организация и
			НЕ стр.ОсновноеКонтактноеЛицо.Пустая() Тогда
			ОсновноеКЛ = стр.ОсновноеКонтактноеЛицо;
		КонецЕсли;
	КонецЦикла;
	Ид_ОсновноеКЛ = ?(ЗначениеЗаполнено(ОсновноеКЛ), СокрЛП(ПолучитьЗначениеСвойства(ОсновноеКЛ, ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("B2B_ИД_КонтактногоЛица"))), "");
	Результат.Вставить("REPRESENTATIV", Новый Структура("XML_ID", Ид_ОсновноеКЛ));
	
	КЛ = ТекЗаказ.КонтактноеЛицо;
	Ид_КЛ = ?(ЗначениеЗаполнено(КЛ), СокрЛП(ПолучитьЗначениеСвойства(КЛ, ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("B2B_ИД_КонтактногоЛица"))), "");
	Результат.Вставить("BUYER_XML_ID ", СокрЛП(Ид_КЛ));
	
	Результат.Вставить("PRODUCTS", Новый Массив());
	               
	ЗапросПоТоварам = Новый Запрос();
	ЗапросПоТоварам.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросПоТоварам.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ *
	|ИЗ
	|	ТабТовары КАК ВремТабТоваров
	|ГДЕ
	|	ВремТабТоваров.Документ = &Документ";
	ЗапросПоТоварам.УстановитьПараметр("Документ", ТекЗаказ);
	МассивТоваров = ЗапросПоТоварам.Выполнить().Выгрузить();
	
	Для каждого ТекНоменклатура из МассивТоваров Цикл
		СтруктураТЧ = Новый Структура;
		СтруктураТЧ.Вставить("CML2_ARTICLE", СокрЛП(ТекНоменклатура.Номенклатура.Артикул));
		
		//СтруктураТЧ.Вставить("XML_ID", XMLСтрока(ТекНоменклатура.Номенклатура.СЭ_ТипНоменклатуры) + "#" +XMLСтрока(ТекНоменклатура.Номенклатура));
		СтруктураТЧ.Вставить("XML_ID", ПолучитьИдТовараДляСайта(ТекНоменклатура.Номенклатура,ТекНоменклатура.Характеристика));
		СтруктураТЧ.Вставить("QUANTITY", СокрЛП(Формат(ТекНоменклатура.Количество, "ЧГ=0")));
				
		Всего = ?(ТекЗаказ.ЦенаВключаетНДС,ТекНоменклатура.Сумма,ТекНоменклатура.Сумма + ТекНоменклатура.СуммаНДС);
		
		PRICE = ?(ТекНоменклатура.Количество = 0,Всего,Всего/ТекНоменклатура.Количество);
		BASE_PRICE = ?(ТекЗаказ.ЦенаВключаетНДС,ТекНоменклатура.Цена ,ТекНоменклатура.Цена + ТекНоменклатура.Цена/100*ТекНоменклатура.СтавкаНДС.Ставка); 		
		DISCOUNT_PRICE = BASE_PRICE*ТекНоменклатура.Количество - Всего;
		VAT_RATE = ТекНоменклатура.СтавкаНДС.Ставка/100;
		VAT_INCLUDED  = ?(ТекЗаказ.ЦенаВключаетНДС,1,0);
		
		СтруктураТЧ.Вставить("PRICE", СокрЛП(Формат(PRICE, "ЧГ=0")));
        СтруктураТЧ.Вставить("BASE_PRICE", СокрЛП(Формат(BASE_PRICE, "ЧГ=0")));
		СтруктураТЧ.Вставить("DISCOUNT_PRICE", СокрЛП(Формат(DISCOUNT_PRICE, "ЧГ=0")));
		СтруктураТЧ.Вставить("VAT_RATE", СокрЛП(Формат(VAT_RATE, "ЧГ=0")));
		СтруктураТЧ.Вставить("VAT_INCLUDED", СокрЛП(Формат(VAT_INCLUDED, "ЧГ=0")));

		
		Результат.PRODUCTS.Добавить(СтруктураТЧ);
	КонецЦикла;
	                               
	
	Возврат Результат;
	
КонецФункции

Процедура ВыгрузитьСтатусы(НастройкиПодключения, МассивДокументов) Экспорт
	
	АдресСервера    = НастройкиПодключения.Получить("АдресСервера");
	Логин 			= НастройкиПодключения.Получить("Логин");
	Пароль       	= НастройкиПодключения.Получить("Пароль");

	ТелоЗапроса = Новый Массив();
	
	Для Каждого ТекЗаказ из МассивДокументов Цикл
//1БЦ++ работы по задаче 32798
//		Структура = Новый Структура("ORDER_XML_ID, STATUS");
		Структура = Новый Структура("ORDER_XML_ID, STATUS, STATUS_DATA");
//1БЦ работы по задаче 32798
		Структура.ORDER_XML_ID = СокрЛП(ТекЗаказ.Ссылка.УникальныйИдентификатор());
//1БЦ++ работы по задаче 32798
//		Структура.STATUS = СокрЛП(ПолучитьСтатусЗаказа(ТекЗаказ));
		Статус = ПолучитьСтатусЗаказа(ТекЗаказ,Истина);
		Структура.STATUS = СокрЛП(Статус.Статус);
		Структура.STATUS_DATA = Статус.Дата;
//1БЦ-- работы по задаче 32798
		ТелоЗапроса.Добавить(Структура);
	КонецЦикла;
	
	ТелоЗапросаJSON = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(ТелоЗапроса);
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");

	HTTPЗапрос  = Новый HTTPЗапрос("local/service/UpdateOrderStatus/", ЗаголовокHTTP);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	HTTPОтвет   = Неопределено;
	ТекстОшибки = "";
	
	ЗащищенноеСоединение = ИнтеграцияИСПовтИсп.ЗащищенноеСоединение();
	
	Попытка
		
		Соединение = Новый HTTPСоединение(
			АдресСервера,
			,
			Логин,
			Пароль,
			,
			60, ЗащищенноеСоединение);
		
		HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Сообщить(НСтр("ru='Ошибка отправки информации по статусам'") + Символы.ПС +
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		Возврат;
		
	КонецПопытки;
	
	РезультатОтправкиЗапроса = B2B_ОбщиеПроцедурыИФункции.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(
		HTTPОтвет, ТекстОшибки);
		
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
						
			Сообщить("Статус успешно обновлен!");
			
		Иначе
			
			Сообщить(ИнтерфейсМОТПСлужебный.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				НСтр("ru='Отправка данных о статусах'"),
				РезультатОтправкиЗапроса));
				
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		Сообщить(СтрШаблон(
			НСтр("ru='Данные о статусах не отправлены.
				     |Текст ошибки: %1'"),
			РезультатОтправкиЗапроса.ТекстОшибки));
			
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьОстатки(НастройкиПодключения, МассивНоменклатуры) Экспорт
	
	АдресСервера    = НастройкиПодключения.Получить("АдресСервера");
	Логин 			= НастройкиПодключения.Получить("Логин");
	Пароль       	= НастройкиПодключения.Получить("Пароль");

	ТелоЗапроса = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	СУММА(Остатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВремТоварыНаСкладахОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			Номенклатура В (&МассивНоменклатуры)
	|				И Склад В
	|					(ВЫБРАТЬ
	|						СкладОстатков.Склад КАК Склад
	|					ИЗ
	|						РегистрСведений.B2B_СоответствиеСкладВидНоменклатуры КАК СкладОстатков)
	|				И Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый)) КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	СУММА(Остатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВремТоварыВРезервеНаСкладахОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Номенклатура В (&МассивНоменклатуры)
	|				И Склад В
	|					(ВЫБРАТЬ
	|						СкладОстатков.Склад КАК Склад
	|					ИЗ
	|						РегистрСведений.B2B_СоответствиеСкладВидНоменклатуры КАК СкладОстатков)) КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	СУММА(Остатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВремТоварыКПередачеСоСкладовОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(
	|			,
	|			Номенклатура В (&МассивНоменклатуры)
	|				И Склад В
	|					(ВЫБРАТЬ
	|						СкладОстатков.Склад КАК Склад
	|					ИЗ
	|						РегистрСведений.B2B_СоответствиеСкладВидНоменклатуры КАК СкладОстатков)
	|				И Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый)) КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыНаСкладах.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыКПередачеСоСкладов.КоличествоОстаток, 0) КАК Количество 
	|ИЗ
	|	ВремТоварыНаСкладахОстатки КАК ТоварыНаСкладах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТоварыВРезервеНаСкладахОстатки КАК ТоварыВРезервеНаСкладах
	|		ПО ТоварыНаСкладах.Номенклатура = ТоварыВРезервеНаСкладах.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТоварыКПередачеСоСкладовОстатки КАК ТоварыКПередачеСоСкладов
	|		ПО ТоварыНаСкладах.Номенклатура = ТоварыКПередачеСоСкладов.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТоварыНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТоварыВРезервеНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТоварыКПередачеСоСкладовОстатки";
	
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураОстатки = Новый Структура;
		СтруктураОстатки.Вставить("XML_ID", XMLСтрока(Выборка.Номенклатура.СЭ_ТипНоменклатуры) + "#" +XMLСтрока(Выборка.Номенклатура));
		СтруктураОстатки.Вставить("QUANTITY", Выборка.Количество);
		
		ТелоЗапроса.Добавить(СтруктураОстатки);
	КонецЦикла;

	ТелоЗапросаJSON = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(ТелоЗапроса);
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");

	HTTPЗапрос  = Новый HTTPЗапрос("local/service/PutAvailableStockInformation/", ЗаголовокHTTP);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	HTTPОтвет   = Неопределено;
	ТекстОшибки = "";
	
	ЗащищенноеСоединение = ИнтеграцияИСПовтИсп.ЗащищенноеСоединение();
	
	Попытка
		
		Соединение = Новый HTTPСоединение(
			АдресСервера,
			,
			Логин,
			Пароль,
			,
			60, ЗащищенноеСоединение);
		
		HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Сообщить(НСтр("ru='Ошибка отправки информации по остаткам'") + Символы.ПС +
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		Возврат;
		
	КонецПопытки;
	
	РезультатОтправкиЗапроса = B2B_ОбщиеПроцедурыИФункции.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(
		HTTPОтвет, ТекстОшибки);
		
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
						
			Сообщить("Данные успешно отправлены!");
			
		Иначе
			
			Сообщить(ИнтерфейсМОТПСлужебный.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				НСтр("ru='Отправка данных об остатках'"),
				РезультатОтправкиЗапроса));
				
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		Сообщить(СтрШаблон(
			НСтр("ru='Данные об остатках не отправлены.
				     |Текст ошибки: %1'"),
			РезультатОтправкиЗапроса.ТекстОшибки));
			
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

//Функция ПолучитьСтатусЗаказа(Заказ) Экспорт
Функция ПолучитьСтатусЗаказа(Заказ, ВариантСоСтатусомОтгруженИДатой = Ложь) Экспорт
	//Функция скорректирована в рамках задачи 32798, добавлено получение статуса "Отгружен, и даты статуса", но так как функция вызывается из многих мест, 
	//и возможно из внешних обработок - для совместимости добавлен параметр ВариантСоСтатусомОтгруженИДатой. Если он не установлен - возвращается
	//как и раньше только статус строкой, если установлен в истину - то структура со статусом и датой возникновения. Старый код закоментирован
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	B2B_СтатусыЗаказов.СтатусЗаказа КАК Статус
	//|ИЗ
	//|	РегистрСведений.B2B_СтатусыЗаказов.СрезПоследних КАК B2B_СтатусыЗаказов
	//|ГДЕ
	//|	B2B_СтатусыЗаказов.ЗаказПокупателя = &Заказ";
	//
	//Запрос.УстановитьПараметр("Заказ", Заказ);
	//
	//Рез = Запрос.Выполнить().Выбрать();
	//
	//Если Рез.Следующий() Тогда
	//	Возврат Рез.Статус.ИмяПредопределенныхДанных;
	//КонецЕсли;
	//
	//Возврат Справочники.B2B_СтатусыЗаказов.Новый.ИмяПредопределенныхДанных;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	""Отгружен"" КАК Статус, Период КАК Период
	//|ИЗ
	//|	РегистрСведений.RC_СтатусОтгрузки.СрезПоследних(, Документ.CRM_Основание = &Заказ) КАК RC_СтатусОтгрузки
	//|ГДЕ
	//|	RC_СтатусОтгрузки.Статус = Истина
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	|	B2B_СтатусыЗаказов.СтатусЗаказа КАК Статус, Период КАК Период	
	|ИЗ
	|	РегистрСведений.B2B_СтатусыЗаказов.СрезПоследних(,ЗаказПокупателя = &Заказ) КАК B2B_СтатусыЗаказов";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	Рез = Запрос.Выполнить().Выбрать();
	Если ВариантСоСтатусомОтгруженИДатой Тогда 
		Если Рез.Следующий() Тогда
			Если Рез.Статус = "Отгружен" Тогда
				Возврат Новый Структура("Статус,Дата","Отгружен",Рез.Период);
			Иначе     
				Возврат Новый Структура("Статус,Дата",Рез.Статус.ИмяПредопределенныхДанных,Рез.Период);
				
			КонецЕсли;
		КонецЕсли;
		Возврат Новый Структура("Статус,Дата",Справочники.гф_В2ВСтатусЗаказаКлиента.Новый.ИмяПредопределенныхДанных,ТекущаяДата());
	Иначе                                                                       
		//Здесь как раз код для совместимости возвращаемых данных, если придет вызов по старому
		Если Рез.Следующий() Тогда
			Если Рез.Статус = "Отгружен" Тогда
				Возврат "Отгружен";
			Иначе
				Возврат Рез.Статус.ИмяПредопределенныхДанных;
			КонецЕсли;
		КонецЕсли;
		Возврат Справочники.гф_В2ВСтатусЗаказаКлиента.Новый.ИмяПредопределенныхДанных; 
	КонецЕсли;
	
	
КонецФункции

Процедура СохранитьНастройкиПодключенияПортал(НастройкиПодключения) Экспорт
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("B2B_НастройкаПодключения", , НастройкиПодключения,,"B2B_User");	
	
КонецПроцедуры

Функция ВосстановитьНастройкиПодключенияПортал(ИмяПользоват = "") Экспорт
	
	Если ИмяПользоват = "" Тогда
		ИмяПользоват_ = "B2B_User";
	Иначе                          
		ИмяПользоват_ = ИмяПользоват;
	КонецЕсли;
	
	НастройкиПодключения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("B2B_НастройкаПодключения",,,,ИмяПользоват_);
	
	Возврат НастройкиПодключения;
	
КонецФункции  

Процедура ВыгрузитьСпецификацию(НастройкиПодключения, МассивДокументов) Экспорт
	АдресСервера    = НастройкиПодключения.Получить("АдресСервера");
	Логин 			= НастройкиПодключения.Получить("Логин");
	Пароль       	= НастройкиПодключения.Получить("Пароль");
	
	ТелоЗапроса = Новый Массив();
	
	Для Каждого ТекЗаказ из МассивДокументов Цикл
		Структура = Новый Структура("ORDER_XML_ID, SPECIFICATION_1");
		Структура.ORDER_XML_ID = СокрЛП(ТекЗаказ.Ссылка.УникальныйИдентификатор());
		
		ТабДок = ТекЗаказ.ПолучитьОбъект().B2B_ПечатьСпецификации();	
		ИмяФайла = ПолучитьИмяВременногоФайла("pdf");
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
		ДанныеФайла = Новый ДвоичныеДанные(ИмяФайла);
		base64 = Base64Строка(ДанныеФайла);
		
		Структура.SPECIFICATION_1 = "data:application/pdf;base64, " + base64;
		ТелоЗапроса.Добавить(Структура);
	КонецЦикла;
	
	ТелоЗапросаJSON = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(ТелоЗапроса);
		
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	
	HTTPЗапрос  = Новый HTTPЗапрос("local/service/DocumentUpdate/", ЗаголовокHTTP);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	HTTPОтвет   = Неопределено;
	ТекстОшибки = "";
	
	ЗащищенноеСоединение = ИнтеграцияИСПовтИсп.ЗащищенноеСоединение();
	
	Попытка
		
		Соединение = Новый HTTPСоединение(
		АдресСервера,
		,
		Логин,
		Пароль,
		,
		60, ЗащищенноеСоединение);
		
		HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Сообщить(НСтр("ru='Ошибка отправки спецификации'") + Символы.ПС +
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат;
		
	КонецПопытки;
	
	РезультатОтправкиЗапроса = B2B_ОбщиеПроцедурыИФункции.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(
	HTTPОтвет, ТекстОшибки);
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда 
			
			Для Каждого ТекЗаказ из МассивДокументов Цикл
				СтруктураСвойства = Новый Структура;
				СтруктураСвойства.Вставить("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("B2B_ДатаОтправки_Спец1"));
				СтруктураСвойства.Вставить("Значение", ТекущаяДата());
				ЗаписатьЗначениеСвойства(ТекЗаказ, СтруктураСвойства);
			КонецЦикла;
			
			Сообщить("Спецификация успешно отправлена!");
			
		Иначе
			
			Сообщить(ИнтерфейсМОТПСлужебный.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			НСтр("ru='Отправка данных о спецификации'"),
			РезультатОтправкиЗапроса));
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		Сообщить(СтрШаблон(
		НСтр("ru='Данные о спецификации не отправлены.
		|Текст ошибки: %1'"),
		РезультатОтправкиЗапроса.ТекстОшибки));
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьОбщуюСпецификацию(НастройкиПодключения, МассивДокументов) Экспорт
	
	АдресСервера    = НастройкиПодключения.Получить("АдресСервера");
	Логин 			= НастройкиПодключения.Получить("Логин");
	Пароль       	= НастройкиПодключения.Получить("Пароль");
	
	ТелоЗапроса = Новый Массив();
	
	Для Каждого ТекЗаказ из МассивДокументов Цикл
		Структура = Новый Структура("ORDER_XML_ID, SPECIFICATION_2");
		Структура.ORDER_XML_ID = СокрЛП(ТекЗаказ.Ссылка.УникальныйИдентификатор());
		
		ТабДок = ПолучитьОбщуюСпецификацию(ТекЗаказ);	
		ИмяФайла = ПолучитьИмяВременногоФайла("xls");
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.xls);
		ДанныеФайла = Новый ДвоичныеДанные(ИмяФайла);
		base64 = Base64Строка(ДанныеФайла);
		
		Структура.SPECIFICATION_2 = "data:application/xls;base64, " + base64;
		ТелоЗапроса.Добавить(Структура);
	КонецЦикла;
	
	ТелоЗапросаJSON = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(ТелоЗапроса);
		
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	
	HTTPЗапрос  = Новый HTTPЗапрос("local/service/DocumentUpdate/", ЗаголовокHTTP);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	HTTPОтвет   = Неопределено;
	ТекстОшибки = "";
	
	ЗащищенноеСоединение = ИнтеграцияИСПовтИсп.ЗащищенноеСоединение();
	
	Попытка
		
		Соединение = Новый HTTPСоединение(
		АдресСервера,
		,
		Логин,
		Пароль,
		,
		60, ЗащищенноеСоединение);
		
		HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Сообщить(НСтр("ru='Ошибка отправки общей спецификации'") + Символы.ПС +
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат;
		
	КонецПопытки;
	
	РезультатОтправкиЗапроса = B2B_ОбщиеПроцедурыИФункции.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(
	HTTPОтвет, ТекстОшибки);
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда 
			
			Для Каждого ТекЗаказ из МассивДокументов Цикл
				СтруктураСвойства = Новый Структура;
				СтруктураСвойства.Вставить("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("B2B_ДатаОтправки_Спец2"));
				СтруктураСвойства.Вставить("Значение", ТекущаяДата());
				ЗаписатьЗначениеСвойства(ТекЗаказ, СтруктураСвойства);
			КонецЦикла;
			
			Сообщить("Спецификация общая успешно отправлена!");
			
		Иначе
			
			Сообщить(ИнтерфейсМОТПСлужебный.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			НСтр("ru='Отправка данных об общей спецификации'"),
			РезультатОтправкиЗапроса));
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		Сообщить(СтрШаблон(
		НСтр("ru='Данные об общей спецификации не отправлены.
		|Текст ошибки: %1'"),
		РезультатОтправкиЗапроса.ТекстОшибки));
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОбщуюСпецификацию(Заказ)
	
	ДвоичныеДанные = Справочники.ВнешниеОбработки.НайтиПоНаименованию("Формирование общей спецификации").ХранилищеВнешнейОбработки.Получить();
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат Новый ТабличныйДокумент;
	КонецЕсли;
	
	ТабДокумент = Неопределено;
	
	ИмяФайла = ПолучитьИмяВременногоФайла("erf");
	ДвоичныеДанные.Записать(ИмяФайла);
	Обработка = ВнешниеОтчеты.Создать(ИмяФайла);
	
	Форма = Обработка.ПолучитьФорму("ВнешнийОтчет.ФормированиеОбщейСпецификации_МС.Форма");
	
	Стр = Форма.ТаблицаДокументы.Добавить();
	Стр.Пометка = Истина;
	Стр.Документ = Заказ;
	Стр.Контрагент  = Заказ.Контрагент;
	Стр.ДоговорКонтрагента  = Заказ.ДоговорКонтрагента;
	Стр.СкладОтправитель  = Заказ.СкладГруппа;
	
	Обработка.Контрагент = Заказ.Контрагент;
	Форма.Контрагент = Заказ.Контрагент;
	
	Форма.ДатаНачала = НачалоМесяца(Заказ.Дата);
	Форма.ДатаОкончания = КонецМесяца(Заказ.Дата);
	
	СхемаКомпоновки = Обработка.ПолучитьМакет("ВыборНоменклатуры");
	Форма.КомпоновщикОтбораНоменклатуры.Инициализировать(новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки));
	Форма.КомпоновщикОтбораНоменклатуры.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	
	ПараметрыДанных = ФОрма.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПараметрыДанных.УстановитьЗначениеПараметра("ТипЦенОптовая", Справочники.w_Настройки.ТипЦенОптовая.Значение);
	ПараметрыДанных.УстановитьЗначениеПараметра("ТипЦенРозничная", Справочники.w_Настройки.ТипЦенРозничная.Значение);
	
	
	Форма.ВидДокумента = 2;
	
	Возврат Форма.Сформировать();	
	
КонецФункции

Функция ПолучитьСчет(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	|ГДЕ
	|	СчетНаОплатуПокупателю.ЗаказПокупателя = &ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", Ссылка);
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Функция ПолучитьПечатнуюФормуДокумента(ТекДокумент) Экспорт
    МД = Метаданные.НайтиПоТипу(ТипЗнч(ТекДокумент));
    ТекВид = МД.Имя;

    МассивОбъектов = Новый Массив();
    МассивОбъектов.Добавить(ТекДокумент);
    ПараметрыПечати = Новый Структура(); //»ДополнитьКомплектВнешнимиПечатнымиФормами» = ложь
    ДопустимыеТипыОбъектовПечати = Неопределено;

    Если ТекВид = "ЗаказКлиента" Тогда
        ИмяМенеджераПечати = "Обработка.ПечатьСчетаНаОплату";
        ИменаМакетов = "СчетЗаказ";
    ИначеЕсли ТекВид = "АктСверкиВзаиморасчетов" Тогда
        ИмяМенеджераПечати = "Документ.АктСверкиВзаиморасчетов";
        ИменаМакетов = "АктСверки";
    ИначеЕсли ТекВид = "РеализацияТоваровУслуг" Тогда
        ИмяМенеджераПечати = "Документ.РеализацияТоваровУслуг";
        ИменаМакетов = "Накладная";
        //ИменаМакетов = «Акт»;//Для акта
    Иначе
        Возврат Неопределено;
    КонецЕсли;

    ПечатныеФормы = УправлениеПечатью.СформироватьПечатныеФормы(ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов, ПараметрыПечати, ДопустимыеТипыОбъектовПечати);

    Возврат ПечатныеФормы.КоллекцияПечатныхФорм[0].ТабличныйДокумент;
КонецФункции

Процедура ВыгрузитьСчета(НастройкиПодключения, МассивДокументов) Экспорт
	
	АдресСервера    = НастройкиПодключения.Получить("АдресСервера");
	Логин 			= НастройкиПодключения.Получить("Логин");
	Пароль       	= НастройкиПодключения.Получить("Пароль");
	
	ТелоЗапроса = Новый Массив(); 

	МассивСчетов = Новый Массив();
	
	Для Каждого ТекЗаказ из МассивДокументов Цикл
		
		Счет = ПолучитьСчет(ТекЗаказ);
		Если Не ЗначениеЗаполнено(Счет) Тогда
			Сообщить("Не найден счет по заказу: " + ТекЗаказ);
			Продолжить;
		КонецЕсли;  
		
		МассивСчетов.Добавить(Счет);
		
		Структура = Новый Структура("ORDER_XML_ID, BILL");
		Структура.ORDER_XML_ID = СокрЛП(ТекЗаказ.Ссылка.УникальныйИдентификатор());
		
		//ТабДок = Счет.ПолучитьОбъект().литПечатьСчетаЗаказа("Счет");
		//ТабДок.АвтоМасштаб = Истина;     
		
		
		
		//ДеревоМакетов = УниверсальныеМеханизмы.ПолучитьДеревоМакетовПечати(Счет,Неопределено);
		//СтрМакета1 = ДеревоМакетов.Строки.Найти("Счет на оплату (Штамп) консолидированный (Группировка по заказам)");
		//
		//ТабДок = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Счет, СтрМакета1.Расшифровка);
		ТабДок = ПолучитьПечатнуюФормуДокумента(Счет);
		ТабДок.АвтоМасштаб = Истина;
		
		ИмяФайла = ПолучитьИмяВременногоФайла("pdf");
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
		ДанныеФайла = Новый ДвоичныеДанные(ИмяФайла);
		base64 = Base64Строка(ДанныеФайла);
		
		Структура.BILL = "data:application/pdf;base64, " + base64;
		ТелоЗапроса.Добавить(Структура);
	КонецЦикла;
	
	ТелоЗапросаJSON = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(ТелоЗапроса);
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	
	HTTPЗапрос  = Новый HTTPЗапрос("local/service/DocumentUpdate/", ЗаголовокHTTP);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	HTTPОтвет   = Неопределено;
	ТекстОшибки = "";
	
	ЗащищенноеСоединение = ИнтеграцияИСПовтИсп.ЗащищенноеСоединение();
	
	Попытка
		
		Соединение = Новый HTTPСоединение(
		АдресСервера,
		,
		Логин,
		Пароль,
		,
		60, ЗащищенноеСоединение);
		
		HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Сообщить(НСтр("ru='Ошибка отправки счетов'") + Символы.ПС +
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат;
		
	КонецПопытки;
	
	РезультатОтправкиЗапроса = B2B_ОбщиеПроцедурыИФункции.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(
	HTTPОтвет, ТекстОшибки);
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда 
			
			Для Каждого ТекСчет из МассивСчетов Цикл
				СтруктураСвойства = Новый Структура;
				СтруктураСвойства.Вставить("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("B2B_ДатаОтправкиСчет"));
				СтруктураСвойства.Вставить("Значение", ТекущаяДата());
				ЗаписатьЗначениеСвойства(ТекСчет, СтруктураСвойства);
			КонецЦикла;
			
			Сообщить("Данные счета успешно отправлены!");
			
		Иначе
			
			Сообщить(ИнтерфейсМОТПСлужебный.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			НСтр("ru='Отправка данных по счету'"),
			РезультатОтправкиЗапроса));
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		Сообщить(СтрШаблон(
		НСтр("ru='Данные по счету не отправлены.
		|Текст ошибки: %1'"),
		РезультатОтправкиЗапроса.ТекстОшибки));
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьРазмерныйРяд(Номенклатура) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КомплектующиеНоменклатуры.Комплектующая КАК Комплектующая,
	|	КомплектующиеНоменклатуры.Количество КАК Количество,
	|	ЗначенияСвойствОбъектов.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО КомплектующиеНоменклатуры.Комплектующая = ЗначенияСвойствОбъектов.Объект
	|			И (ЗначенияСвойствОбъектов.Свойство = &Свойство)
	|ГДЕ
	|	КомплектующиеНоменклатуры.Номенклатура = &Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Значение";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Свойство", Справочники.w_Настройки.Свойство_Size.Значение);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	РР = "";
	Для Каждого Строка Из Рез Цикл
		РР = РР + Строка.Значение+"-"+Строка.Количество+"|";		
	КонецЦикла;
	
	Возврат РР;
	
КонецФункции

Функция ПолучитьРазмерныйРядДляФильтра(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КомплектующиеНоменклатуры.Комплектующая КАК Комплектующая,
	|	КомплектующиеНоменклатуры.Количество КАК Количество,
	|	ЗначенияСвойствОбъектов.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО КомплектующиеНоменклатуры.Комплектующая = ЗначенияСвойствОбъектов.Объект
	|			И (ЗначенияСвойствОбъектов.Свойство = &Свойство)
	|ГДЕ
	|	КомплектующиеНоменклатуры.Номенклатура = &Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Значение";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Свойство", Справочники.w_Настройки.Свойство_Size.Значение);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Миним = 0;
	Максим = 0;
	врРез = "";
	Для Каждого Строка Из Рез Цикл
		Попытка
			врЧисло = Число(Строка.Значение);
			
			Если Миним > врЧисло ИЛИ Миним = 0 Тогда
				Миним = врЧисло;
			КонецЕсли;	
			
			Если Максим < врЧисло  Тогда
				Максим = врЧисло;
			КонецЕсли;
		Исключение
			
		КонецПопытки;
	КонецЦикла;  
	Если Миним <> 0 или Максим <> 0 Тогда
		врРез = Строка(Миним) + "-" +Строка(Максим);
	КонецЕсли;   
	
	Возврат врРез;
		
КонецФункции

//1БЦ++ МГ 31839
Функция ПолучитьСкидкуПоДоговоруНаДату(ДоговорКонтрагента, Сезон, Период, ТипСкидки)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Скидки.Скидка, 0) КАК Скидка
	|ИЗ
	|	Справочник.w_ТипыСкидок КАК w_ТипыСкидок
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			w_СкидкиКлиентаПоДоговоруСрезПоследних.ТипСкидки КАК ТипСкидки,
	|			w_СкидкиКлиентаПоДоговоруСрезПоследних.Скидка КАК Скидка
	|		ИЗ
	|			РегистрСведений.w_СкидкиКлиентаПоДоговору.СрезПоследних(
	|					&ТекДата,
	|					ДоговорКонтрагента = &ДоговорКонтрагента
	|						И Сезон = &Сезон) КАК w_СкидкиКлиентаПоДоговоруСрезПоследних) КАК Скидки
	|		ПО w_ТипыСкидок.Ссылка = Скидки.ТипСкидки
	|ГДЕ
	|	w_ТипыСкидок.Ссылка = &ТипСкидки";
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Сезон", Сезон);
	Запрос.УстановитьПараметр("ТекДата", Период);
	Запрос.УстановитьПараметр("ТипСкидки", ТипСкидки);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();	
	Если РезультатЗапроса.Следующий() Тогда 
		Возврат РезультатЗапроса.Скидка;
	Иначе      
		Возврат 0;
	КонецЕсли;
	
КонецФункции    
//1БЦ-- МГ 31839
